from numpy import array, float64


from func.matrix_1_4 import matrix_1_4


# Используемые константы

"""1. Конструкционные ограничения"""

MAX_ANGLE_SPHERICAL_JOINT = 35  # max угол шаровых
BORDER_OF_ARM_ANGLE = array((-112.38, 52.62), dtype = float64)   # Знаки соотвтествуют локальным СК
MOVING_GAS_SPRING = array((464, 714), dtype = float64)  # min/max длина пружины (от шаровой до шаровой)

R_CIRCLE = 130    # Радиус окружности (рычага редуктора)
R_SPHERE = 300   # Радиус сферы (тяги)

OFFSET_LOWER = array(([-307, -125 , 0, 0, 0, 0], # Угол gamma подбирался так, чтобы OY лежащих на одной прямой точек были направлены друг на друга
                [45.25,  -328.37, 0, 0, 0, -60],
                [261.75,  -203.37, 0, 0, 0, 120], 
                [261.75,  203.37, 0, 0, 0, 60],   # X, Y, Z, alpha, beta, gamma
                [45.25,  328.37, 0, 0, 0, -120], 
                [-307,  125, 0, 0, 0, 180],
                [-359, 0, -292, 0, 0, 0], # Координаты крепления пружин на нижней плите
                [179.5, -310.9, -292, 0, 0, 120],
                [179.5, 310.9, -292, 0, 0, -120]))  
# Координаты отсутпа верхней плиты (в нулевом положении)
OFFSET_UPPER = array(([-307,  -60, 0, 0, 0, 0],  # X, Y, Z, alpha, beta, gamma 
                [101.54,  -295.87, 0, 0, 0, -60],
                [205.46,  -235.87, 0, 0, 0, 120], 
                [205.46,  235.87, 0, 0, 0, 60], 
                [101.54,  295.87, 0, 0, 0, -120],
                [-307,  60, 0, 0, 0, -180],
                [-307, 0, 0, 0, 0, 0], # Координаты крепления пружин на верхней плите
                [153.5, -265.87, 0, 0, 0, 120],
                [153.5, 265.87, 0, 0, 0, -120]))
ROTATE_LOCAL_CS= array((0, 0, 0, 0, 90, 90)) # Поворачиваю нижние локальные СК так, чтобы ось вращения стала OZ
# Пусть центр тяги находится в (0, 0, 0) в локальных координатах

LOCAL_LOWER_CS = matrix_1_4(0, 0, 0)
LOCAL_UPPER_CS = matrix_1_4(0, 0, 0)