from numpy import array, float64


from func.matrix_1_4 import matrix_1_4


# Используемые константы
def constants():
    
    """1. Конструкционные ограничения"""

    max_angle_spherical_joint = 35  # max угол шаровых
    border_of_arm_angle = array((-112.38, 52.62), dtype = float64)   # Знаки соотвтествуют локальным СК
    moving_gas_spring = array((464, 714), dtype = float64)  # min/max длина пружины (от шаровой до шаровой)

    R = 130    # Радиус окружности (рычага)
    r = 300   # Радиус сферы (тяги)

    offset_lower = array(([-307, -125 , 0, 0, 0, 0], # Угол gamma подбирался так, чтобы OY лежащих на одной прямой точек были направлены друг на друга
                    [45.25,  -328.37, 0, 0, 0, -60],
                    [261.75,  -203.37, 0, 0, 0, 120], 
                    [261.75,  203.37, 0, 0, 0, 60],   # X, Y, Z, alpha, beta, gamma
                    [45.25,  328.37, 0, 0, 0, -120], 
                    [-307,  125, 0, 0, 0, 180],
                    [-359, 0, -292, 0, 0, 0], # Координаты крепления пружин на нижней плите
                    [179.5, -310.9, -292, 0, 0, 120],
                    [179.5, 310.9, -292, 0, 0, -120]))  
    # Координаты отсутпа верхней плиты (в нулевом положении)
    offset_upper = array(([-307,  -60, 0, 0, 0, 0],  # X, Y, Z, alpha, beta, gamma 
                    [101.54,  -295.87, 0, 0, 0, -60],
                    [205.46,  -235.87, 0, 0, 0, 120], 
                    [205.46,  235.87, 0, 0, 0, 60], 
                    [101.54,  295.87, 0, 0, 0, -120],
                    [-307,  60, 0, 0, 0, -180],
                    [-307, 0, 0, 0, 0, 0], # Координаты крепления пружин на верхней плите
                    [153.5, -265.87, 0, 0, 0, 120],
                    [153.5, 265.87, 0, 0, 0, -120]))
    rotate_local_cs= array((0, 0, 0, 0, 90, 90)) # Поворачиваю нижние локальные СК так, чтобы ось вращения стала OZ

    # Пусть центр тяги находится в (0, 0, 0) в локальных координатах
    local_lower_CS = matrix_1_4(0, 0, 0)
    local_upper_CS = matrix_1_4(0, 0, 0)

    return max_angle_spherical_joint, border_of_arm_angle, R, r, moving_gas_spring, offset_lower, offset_upper, rotate_local_cs, local_lower_CS, local_upper_CS